MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAL169/mcu.h
extern volatile __C2FIFOCON14bits_t C2FIFOCON14bits __asm__ ("C2FIFOCON14") __attribute__((section("sfrs"), address(0xBF8816D0)));
extern volatile uint32_t        C2FIFOCON14CLR __attribute__((section("sfrs"),address(0xBF8816D4)));
extern volatile uint32_t        C2FIFOCON14SET __attribute__((section("sfrs"),address(0xBF8816D8)));
extern volatile uint32_t        C2FIFOCON14INV __attribute__((section("sfrs"),address(0xBF8816DC)));
#define C2FIFOINT14 C2FIFOINT14
extern volatile uint32_t   C2FIFOINT14 __attribute__((section("sfrs"), address(0xBF8816E0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT14bits_t;
extern volatile __C2FIFOINT14bits_t C2FIFOINT14bits __asm__ ("C2FIFOINT14") __attribute__((section("sfrs"), address(0xBF8816E0)));
extern volatile uint32_t        C2FIFOINT14CLR __attribute__((section("sfrs"),address(0xBF8816E4)));
extern volatile uint32_t        C2FIFOINT14SET __attribute__((section("sfrs"),address(0xBF8816E8)));
extern volatile uint32_t        C2FIFOINT14INV __attribute__((section("sfrs"),address(0xBF8816EC)));
#define C2FIFOUA14 C2FIFOUA14
extern volatile uint32_t   C2FIFOUA14 __attribute__((section("sfrs"), address(0xBF8816F0)));
extern volatile uint32_t        C2FIFOUA14CLR __attribute__((section("sfrs"),address(0xBF8816F4)));
extern volatile uint32_t        C2FIFOUA14SET __attribute__((section("sfrs"),address(0xBF8816F8)));
extern volatile uint32_t        C2FIFOUA14INV __attribute__((section("sfrs"),address(0xBF8816FC)));
#define C2FIFOCI14 C2FIFOCI14
extern volatile uint32_t   C2FIFOCI14 __attribute__((section("sfrs"), address(0xBF881700)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI14bits_t;
extern volatile __C2FIFOCI14bits_t C2FIFOCI14bits __asm__ ("C2FIFOCI14") __attribute__((section("sfrs"), address(0xBF881700)));
extern volatile uint32_t        C2FIFOCI14CLR __attribute__((section("sfrs"),address(0xBF881704)));
extern volatile uint32_t        C2FIFOCI14SET __attribute__((section("sfrs"),address(0xBF881708)));
extern volatile uint32_t        C2FIFOCI14INV __attribute__((section("sfrs"),address(0xBF88170C)));
#define C2FIFOCON15 C2FIFOCON15
extern volatile uint32_t   C2FIFOCON15 __attribute__((section("sfrs"), address(0xBF881710)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON15bits_t;
extern volatile __C2FIFOCON15bits_t C2FIFOCON15bits __asm__ ("C2FIFOCON15") __attribute__((section("sfrs"), address(0xBF881710)));
extern volatile uint32_t        C2FIFOCON15CLR __attribute__((section("sfrs"),address(0xBF881714)));
extern volatile uint32_t        C2FIFOCON15SET __attribute__((section("sfrs"),address(0xBF881718)));
extern volatile uint32_t        C2FIFOCON15INV __attribute__((section("sfrs"),address(0xBF88171C)));
#define C2FIFOINT15 C2FIFOINT15
extern volatile uint32_t   C2FIFOINT15 __attribute__((section("sfrs"), address(0xBF881720)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT15bits_t;
extern volatile __C2FIFOINT15bits_t C2FIFOINT15bits __asm__ ("C2FIFOINT15") __attribute__((section("sfrs"), address(0xBF881720)));
extern volatile uint32_t        C2FIFOINT15CLR __attribute__((section("sfrs"),address(0xBF881724)));
extern volatile uint32_t        C2FIFOINT15SET __attribute__((section("sfrs"),address(0xBF881728)));
extern volatile uint32_t        C2FIFOINT15INV __attribute__((section("sfrs"),address(0xBF88172C)));
#define C2FIFOUA15 C2FIFOUA15
extern volatile uint32_t   C2FIFOUA15 __attribute__((section("sfrs"), address(0xBF881730)));
extern volatile uint32_t        C2FIFOUA15CLR __attribute__((section("sfrs"),address(0xBF881734)));
extern volatile uint32_t        C2FIFOUA15SET __attribute__((section("sfrs"),address(0xBF881738)));
extern volatile uint32_t        C2FIFOUA15INV __attribute__((section("sfrs"),address(0xBF88173C)));
#define C2FIFOCI15 C2FIFOCI15
extern volatile uint32_t   C2FIFOCI15 __attribute__((section("sfrs"), address(0xBF881740)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI15bits_t;
extern volatile __C2FIFOCI15bits_t C2FIFOCI15bits __asm__ ("C2FIFOCI15") __attribute__((section("sfrs"), address(0xBF881740)));
extern volatile uint32_t        C2FIFOCI15CLR __attribute__((section("sfrs"),address(0xBF881744)));
extern volatile uint32_t        C2FIFOCI15SET __attribute__((section("sfrs"),address(0xBF881748)));
extern volatile uint32_t        C2FIFOCI15INV __attribute__((section("sfrs"),address(0xBF88174C)));
#define C2FIFOCON16 C2FIFOCON16
extern volatile uint32_t   C2FIFOCON16 __attribute__((section("sfrs"), address(0xBF881750)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON16bits_t;
extern volatile __C2FIFOCON16bits_t C2FIFOCON16bits __asm__ ("C2FIFOCON16") __attribute__((section("sfrs"), address(0xBF881750)));
extern volatile uint32_t        C2FIFOCON16CLR __attribute__((section("sfrs"),address(0xBF881754)));
extern volatile uint32_t        C2FIFOCON16SET __attribute__((section("sfrs"),address(0xBF881758)));
extern volatile uint32_t        C2FIFOCON16INV __attribute__((section("sfrs"),address(0xBF88175C)));
#define C2FIFOINT16 C2FIFOINT16
extern volatile uint32_t   C2FIFOINT16 __attribute__((section("sfrs"), address(0xBF881760)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT16bits_t;
