MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAL169/mcu.h
extern volatile __GLCDCLUT158bits_t GLCDCLUT158bits __asm__ ("GLCDCLUT158") __attribute__((section("sfrs"), address(0xBF8EA678)));
#define GLCDCLUT159 GLCDCLUT159
extern volatile uint32_t   GLCDCLUT159 __attribute__((section("sfrs"), address(0xBF8EA67C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT159bits_t;
extern volatile __GLCDCLUT159bits_t GLCDCLUT159bits __asm__ ("GLCDCLUT159") __attribute__((section("sfrs"), address(0xBF8EA67C)));
#define GLCDCLUT160 GLCDCLUT160
extern volatile uint32_t   GLCDCLUT160 __attribute__((section("sfrs"), address(0xBF8EA680)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT160bits_t;
extern volatile __GLCDCLUT160bits_t GLCDCLUT160bits __asm__ ("GLCDCLUT160") __attribute__((section("sfrs"), address(0xBF8EA680)));
#define GLCDCLUT161 GLCDCLUT161
extern volatile uint32_t   GLCDCLUT161 __attribute__((section("sfrs"), address(0xBF8EA684)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT161bits_t;
extern volatile __GLCDCLUT161bits_t GLCDCLUT161bits __asm__ ("GLCDCLUT161") __attribute__((section("sfrs"), address(0xBF8EA684)));
#define GLCDCLUT162 GLCDCLUT162
extern volatile uint32_t   GLCDCLUT162 __attribute__((section("sfrs"), address(0xBF8EA688)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT162bits_t;
extern volatile __GLCDCLUT162bits_t GLCDCLUT162bits __asm__ ("GLCDCLUT162") __attribute__((section("sfrs"), address(0xBF8EA688)));
#define GLCDCLUT163 GLCDCLUT163
extern volatile uint32_t   GLCDCLUT163 __attribute__((section("sfrs"), address(0xBF8EA68C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT163bits_t;
extern volatile __GLCDCLUT163bits_t GLCDCLUT163bits __asm__ ("GLCDCLUT163") __attribute__((section("sfrs"), address(0xBF8EA68C)));
#define GLCDCLUT164 GLCDCLUT164
extern volatile uint32_t   GLCDCLUT164 __attribute__((section("sfrs"), address(0xBF8EA690)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT164bits_t;
extern volatile __GLCDCLUT164bits_t GLCDCLUT164bits __asm__ ("GLCDCLUT164") __attribute__((section("sfrs"), address(0xBF8EA690)));
#define GLCDCLUT165 GLCDCLUT165
extern volatile uint32_t   GLCDCLUT165 __attribute__((section("sfrs"), address(0xBF8EA694)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT165bits_t;
extern volatile __GLCDCLUT165bits_t GLCDCLUT165bits __asm__ ("GLCDCLUT165") __attribute__((section("sfrs"), address(0xBF8EA694)));
#define GLCDCLUT166 GLCDCLUT166
extern volatile uint32_t   GLCDCLUT166 __attribute__((section("sfrs"), address(0xBF8EA698)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT166bits_t;
extern volatile __GLCDCLUT166bits_t GLCDCLUT166bits __asm__ ("GLCDCLUT166") __attribute__((section("sfrs"), address(0xBF8EA698)));
#define GLCDCLUT167 GLCDCLUT167
extern volatile uint32_t   GLCDCLUT167 __attribute__((section("sfrs"), address(0xBF8EA69C)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT167bits_t;
extern volatile __GLCDCLUT167bits_t GLCDCLUT167bits __asm__ ("GLCDCLUT167") __attribute__((section("sfrs"), address(0xBF8EA69C)));
#define GLCDCLUT168 GLCDCLUT168
extern volatile uint32_t   GLCDCLUT168 __attribute__((section("sfrs"), address(0xBF8EA6A0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT168bits_t;
extern volatile __GLCDCLUT168bits_t GLCDCLUT168bits __asm__ ("GLCDCLUT168") __attribute__((section("sfrs"), address(0xBF8EA6A0)));
#define GLCDCLUT169 GLCDCLUT169
extern volatile uint32_t   GLCDCLUT169 __attribute__((section("sfrs"), address(0xBF8EA6A4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT169bits_t;
extern volatile __GLCDCLUT169bits_t GLCDCLUT169bits __asm__ ("GLCDCLUT169") __attribute__((section("sfrs"), address(0xBF8EA6A4)));
#define GLCDCLUT170 GLCDCLUT170
extern volatile uint32_t   GLCDCLUT170 __attribute__((section("sfrs"), address(0xBF8EA6A8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT170bits_t;
extern volatile __GLCDCLUT170bits_t GLCDCLUT170bits __asm__ ("GLCDCLUT170") __attribute__((section("sfrs"), address(0xBF8EA6A8)));
#define GLCDCLUT171 GLCDCLUT171
extern volatile uint32_t   GLCDCLUT171 __attribute__((section("sfrs"), address(0xBF8EA6AC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT171bits_t;
extern volatile __GLCDCLUT171bits_t GLCDCLUT171bits __asm__ ("GLCDCLUT171") __attribute__((section("sfrs"), address(0xBF8EA6AC)));
#define GLCDCLUT172 GLCDCLUT172
extern volatile uint32_t   GLCDCLUT172 __attribute__((section("sfrs"), address(0xBF8EA6B0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT172bits_t;
extern volatile __GLCDCLUT172bits_t GLCDCLUT172bits __asm__ ("GLCDCLUT172") __attribute__((section("sfrs"), address(0xBF8EA6B0)));
#define GLCDCLUT173 GLCDCLUT173
extern volatile uint32_t   GLCDCLUT173 __attribute__((section("sfrs"), address(0xBF8EA6B4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT173bits_t;
extern volatile __GLCDCLUT173bits_t GLCDCLUT173bits __asm__ ("GLCDCLUT173") __attribute__((section("sfrs"), address(0xBF8EA6B4)));
#define GLCDCLUT174 GLCDCLUT174
extern volatile uint32_t   GLCDCLUT174 __attribute__((section("sfrs"), address(0xBF8EA6B8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT174bits_t;
extern volatile __GLCDCLUT174bits_t GLCDCLUT174bits __asm__ ("GLCDCLUT174") __attribute__((section("sfrs"), address(0xBF8EA6B8)));
#define GLCDCLUT175 GLCDCLUT175
extern volatile uint32_t   GLCDCLUT175 __attribute__((section("sfrs"), address(0xBF8EA6BC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT175bits_t;
extern volatile __GLCDCLUT175bits_t GLCDCLUT175bits __asm__ ("GLCDCLUT175") __attribute__((section("sfrs"), address(0xBF8EA6BC)));
#define GLCDCLUT176 GLCDCLUT176
extern volatile uint32_t   GLCDCLUT176 __attribute__((section("sfrs"), address(0xBF8EA6C0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT176bits_t;
extern volatile __GLCDCLUT176bits_t GLCDCLUT176bits __asm__ ("GLCDCLUT176") __attribute__((section("sfrs"), address(0xBF8EA6C0)));
#define GLCDCLUT177 GLCDCLUT177
extern volatile uint32_t   GLCDCLUT177 __attribute__((section("sfrs"), address(0xBF8EA6C4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT177bits_t;
extern volatile __GLCDCLUT177bits_t GLCDCLUT177bits __asm__ ("GLCDCLUT177") __attribute__((section("sfrs"), address(0xBF8EA6C4)));
#define GLCDCLUT178 GLCDCLUT178
extern volatile uint32_t   GLCDCLUT178 __attribute__((section("sfrs"), address(0xBF8EA6C8)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT178bits_t;
extern volatile __GLCDCLUT178bits_t GLCDCLUT178bits __asm__ ("GLCDCLUT178") __attribute__((section("sfrs"), address(0xBF8EA6C8)));
#define GLCDCLUT179 GLCDCLUT179
extern volatile uint32_t   GLCDCLUT179 __attribute__((section("sfrs"), address(0xBF8EA6CC)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT179bits_t;
extern volatile __GLCDCLUT179bits_t GLCDCLUT179bits __asm__ ("GLCDCLUT179") __attribute__((section("sfrs"), address(0xBF8EA6CC)));
#define GLCDCLUT180 GLCDCLUT180
extern volatile uint32_t   GLCDCLUT180 __attribute__((section("sfrs"), address(0xBF8EA6D0)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT180bits_t;
extern volatile __GLCDCLUT180bits_t GLCDCLUT180bits __asm__ ("GLCDCLUT180") __attribute__((section("sfrs"), address(0xBF8EA6D0)));
#define GLCDCLUT181 GLCDCLUT181
extern volatile uint32_t   GLCDCLUT181 __attribute__((section("sfrs"), address(0xBF8EA6D4)));
typedef struct {
  uint32_t BLUE:8;
  uint32_t GREEN:8;
  uint32_t RED:8;
} __GLCDCLUT181bits_t;
