MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAL169/mcu.h
extern volatile __GLCDCURDATA93bits_t GLCDCURDATA93bits __asm__ ("GLCDCURDATA93") __attribute__((section("sfrs"), address(0xBF8EA974)));
#define GLCDCURDATA94 GLCDCURDATA94
extern volatile uint32_t   GLCDCURDATA94 __attribute__((section("sfrs"), address(0xBF8EA978)));
typedef struct {
  uint32_t PIXEL2323:4;
  uint32_t PIXEL2322:4;
  uint32_t PIXEL2321:4;
  uint32_t PIXEL2320:4;
  uint32_t PIXEL2319:4;
  uint32_t PIXEL2318:4;
  uint32_t PIXEL2317:4;
  uint32_t PIXEL2316:4;
} __GLCDCURDATA94bits_t;
extern volatile __GLCDCURDATA94bits_t GLCDCURDATA94bits __asm__ ("GLCDCURDATA94") __attribute__((section("sfrs"), address(0xBF8EA978)));
#define GLCDCURDATA95 GLCDCURDATA95
extern volatile uint32_t   GLCDCURDATA95 __attribute__((section("sfrs"), address(0xBF8EA97C)));
typedef struct {
  uint32_t PIXEL2331:4;
  uint32_t PIXEL2330:4;
  uint32_t PIXEL2329:4;
  uint32_t PIXEL2328:4;
  uint32_t PIXEL2327:4;
  uint32_t PIXEL2326:4;
  uint32_t PIXEL2325:4;
  uint32_t PIXEL2324:4;
} __GLCDCURDATA95bits_t;
extern volatile __GLCDCURDATA95bits_t GLCDCURDATA95bits __asm__ ("GLCDCURDATA95") __attribute__((section("sfrs"), address(0xBF8EA97C)));
#define GLCDCURDATA96 GLCDCURDATA96
extern volatile uint32_t   GLCDCURDATA96 __attribute__((section("sfrs"), address(0xBF8EA980)));
typedef struct {
  uint32_t PIXEL247:4;
  uint32_t PIXEL246:4;
  uint32_t PIXEL245:4;
  uint32_t PIXEL244:4;
  uint32_t PIXEL243:4;
  uint32_t PIXEL242:4;
  uint32_t PIXEL241:4;
  uint32_t PIXEL240:4;
} __GLCDCURDATA96bits_t;
extern volatile __GLCDCURDATA96bits_t GLCDCURDATA96bits __asm__ ("GLCDCURDATA96") __attribute__((section("sfrs"), address(0xBF8EA980)));
#define GLCDCURDATA97 GLCDCURDATA97
extern volatile uint32_t   GLCDCURDATA97 __attribute__((section("sfrs"), address(0xBF8EA984)));
typedef struct {
  uint32_t PIXEL2415:4;
  uint32_t PIXEL2414:4;
  uint32_t PIXEL2413:4;
  uint32_t PIXEL2412:4;
  uint32_t PIXEL2411:4;
  uint32_t PIXEL2410:4;
  uint32_t PIXEL249:4;
  uint32_t PIXEL248:4;
} __GLCDCURDATA97bits_t;
extern volatile __GLCDCURDATA97bits_t GLCDCURDATA97bits __asm__ ("GLCDCURDATA97") __attribute__((section("sfrs"), address(0xBF8EA984)));
#define GLCDCURDATA98 GLCDCURDATA98
extern volatile uint32_t   GLCDCURDATA98 __attribute__((section("sfrs"), address(0xBF8EA988)));
typedef struct {
  uint32_t PIXEL2423:4;
  uint32_t PIXEL2422:4;
  uint32_t PIXEL2421:4;
  uint32_t PIXEL2420:4;
  uint32_t PIXEL2419:4;
  uint32_t PIXEL2418:4;
  uint32_t PIXEL2417:4;
  uint32_t PIXEL2416:4;
} __GLCDCURDATA98bits_t;
extern volatile __GLCDCURDATA98bits_t GLCDCURDATA98bits __asm__ ("GLCDCURDATA98") __attribute__((section("sfrs"), address(0xBF8EA988)));
#define GLCDCURDATA99 GLCDCURDATA99
extern volatile uint32_t   GLCDCURDATA99 __attribute__((section("sfrs"), address(0xBF8EA98C)));
typedef struct {
  uint32_t PIXEL2431:4;
  uint32_t PIXEL2430:4;
  uint32_t PIXEL2429:4;
  uint32_t PIXEL2428:4;
  uint32_t PIXEL2427:4;
  uint32_t PIXEL2426:4;
  uint32_t PIXEL2425:4;
  uint32_t PIXEL2424:4;
} __GLCDCURDATA99bits_t;
extern volatile __GLCDCURDATA99bits_t GLCDCURDATA99bits __asm__ ("GLCDCURDATA99") __attribute__((section("sfrs"), address(0xBF8EA98C)));
#define GLCDCURDATA100 GLCDCURDATA100
extern volatile uint32_t   GLCDCURDATA100 __attribute__((section("sfrs"), address(0xBF8EA990)));
typedef struct {
  uint32_t PIXEL257:4;
  uint32_t PIXEL256:4;
  uint32_t PIXEL255:4;
  uint32_t PIXEL254:4;
  uint32_t PIXEL253:4;
  uint32_t PIXEL252:4;
  uint32_t PIXEL251:4;
  uint32_t PIXEL250:4;
} __GLCDCURDATA100bits_t;
extern volatile __GLCDCURDATA100bits_t GLCDCURDATA100bits __asm__ ("GLCDCURDATA100") __attribute__((section("sfrs"), address(0xBF8EA990)));
#define GLCDCURDATA101 GLCDCURDATA101
extern volatile uint32_t   GLCDCURDATA101 __attribute__((section("sfrs"), address(0xBF8EA994)));
typedef struct {
  uint32_t PIXEL2515:4;
  uint32_t PIXEL2514:4;
  uint32_t PIXEL2513:4;
  uint32_t PIXEL2512:4;
  uint32_t PIXEL2511:4;
  uint32_t PIXEL2510:4;
  uint32_t PIXEL259:4;
  uint32_t PIXEL258:4;
} __GLCDCURDATA101bits_t;
extern volatile __GLCDCURDATA101bits_t GLCDCURDATA101bits __asm__ ("GLCDCURDATA101") __attribute__((section("sfrs"), address(0xBF8EA994)));
#define GLCDCURDATA102 GLCDCURDATA102
extern volatile uint32_t   GLCDCURDATA102 __attribute__((section("sfrs"), address(0xBF8EA998)));
typedef struct {
  uint32_t PIXEL2523:4;
  uint32_t PIXEL2522:4;
  uint32_t PIXEL2521:4;
  uint32_t PIXEL2520:4;
  uint32_t PIXEL2519:4;
  uint32_t PIXEL2518:4;
  uint32_t PIXEL2517:4;
  uint32_t PIXEL2516:4;
} __GLCDCURDATA102bits_t;
extern volatile __GLCDCURDATA102bits_t GLCDCURDATA102bits __asm__ ("GLCDCURDATA102") __attribute__((section("sfrs"), address(0xBF8EA998)));
#define GLCDCURDATA103 GLCDCURDATA103
extern volatile uint32_t   GLCDCURDATA103 __attribute__((section("sfrs"), address(0xBF8EA99C)));
typedef struct {
  uint32_t PIXEL2531:4;
  uint32_t PIXEL2530:4;
  uint32_t PIXEL2529:4;
  uint32_t PIXEL2528:4;
  uint32_t PIXEL2527:4;
  uint32_t PIXEL2526:4;
  uint32_t PIXEL2525:4;
  uint32_t PIXEL2524:4;
} __GLCDCURDATA103bits_t;
extern volatile __GLCDCURDATA103bits_t GLCDCURDATA103bits __asm__ ("GLCDCURDATA103") __attribute__((section("sfrs"), address(0xBF8EA99C)));
#define GLCDCURDATA104 GLCDCURDATA104
extern volatile uint32_t   GLCDCURDATA104 __attribute__((section("sfrs"), address(0xBF8EA9A0)));
typedef struct {
  uint32_t PIXEL267:4;
  uint32_t PIXEL266:4;
  uint32_t PIXEL265:4;
  uint32_t PIXEL264:4;
  uint32_t PIXEL263:4;
  uint32_t PIXEL262:4;
  uint32_t PIXEL261:4;
  uint32_t PIXEL260:4;
} __GLCDCURDATA104bits_t;
extern volatile __GLCDCURDATA104bits_t GLCDCURDATA104bits __asm__ ("GLCDCURDATA104") __attribute__((section("sfrs"), address(0xBF8EA9A0)));
#define GLCDCURDATA105 GLCDCURDATA105
extern volatile uint32_t   GLCDCURDATA105 __attribute__((section("sfrs"), address(0xBF8EA9A4)));
typedef struct {
  uint32_t PIXEL2615:4;
  uint32_t PIXEL2614:4;
  uint32_t PIXEL2613:4;
  uint32_t PIXEL2612:4;
  uint32_t PIXEL2611:4;
  uint32_t PIXEL2610:4;
  uint32_t PIXEL269:4;
  uint32_t PIXEL268:4;
} __GLCDCURDATA105bits_t;
