MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ2064DAL169/mcu.h
#define _GLCDCLUT135_RED_POSITION                0x00000010
#define _GLCDCLUT135_RED_MASK                    0x00FF0000
#define _GLCDCLUT135_RED_LENGTH                  0x00000008

#define _GLCDCLUT136_BLUE_POSITION               0x00000000
#define _GLCDCLUT136_BLUE_MASK                   0x000000FF
#define _GLCDCLUT136_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT136_GREEN_POSITION              0x00000008
#define _GLCDCLUT136_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT136_GREEN_LENGTH                0x00000008

#define _GLCDCLUT136_RED_POSITION                0x00000010
#define _GLCDCLUT136_RED_MASK                    0x00FF0000
#define _GLCDCLUT136_RED_LENGTH                  0x00000008

#define _GLCDCLUT137_BLUE_POSITION               0x00000000
#define _GLCDCLUT137_BLUE_MASK                   0x000000FF
#define _GLCDCLUT137_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT137_GREEN_POSITION              0x00000008
#define _GLCDCLUT137_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT137_GREEN_LENGTH                0x00000008

#define _GLCDCLUT137_RED_POSITION                0x00000010
#define _GLCDCLUT137_RED_MASK                    0x00FF0000
#define _GLCDCLUT137_RED_LENGTH                  0x00000008

#define _GLCDCLUT138_BLUE_POSITION               0x00000000
#define _GLCDCLUT138_BLUE_MASK                   0x000000FF
#define _GLCDCLUT138_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT138_GREEN_POSITION              0x00000008
#define _GLCDCLUT138_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT138_GREEN_LENGTH                0x00000008

#define _GLCDCLUT138_RED_POSITION                0x00000010
#define _GLCDCLUT138_RED_MASK                    0x00FF0000
#define _GLCDCLUT138_RED_LENGTH                  0x00000008

#define _GLCDCLUT139_BLUE_POSITION               0x00000000
#define _GLCDCLUT139_BLUE_MASK                   0x000000FF
#define _GLCDCLUT139_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT139_GREEN_POSITION              0x00000008
#define _GLCDCLUT139_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT139_GREEN_LENGTH                0x00000008

#define _GLCDCLUT139_RED_POSITION                0x00000010
#define _GLCDCLUT139_RED_MASK                    0x00FF0000
#define _GLCDCLUT139_RED_LENGTH                  0x00000008

#define _GLCDCLUT140_BLUE_POSITION               0x00000000
#define _GLCDCLUT140_BLUE_MASK                   0x000000FF
#define _GLCDCLUT140_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT140_GREEN_POSITION              0x00000008
#define _GLCDCLUT140_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT140_GREEN_LENGTH                0x00000008

#define _GLCDCLUT140_RED_POSITION                0x00000010
#define _GLCDCLUT140_RED_MASK                    0x00FF0000
#define _GLCDCLUT140_RED_LENGTH                  0x00000008

#define _GLCDCLUT141_BLUE_POSITION               0x00000000
#define _GLCDCLUT141_BLUE_MASK                   0x000000FF
#define _GLCDCLUT141_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT141_GREEN_POSITION              0x00000008
#define _GLCDCLUT141_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT141_GREEN_LENGTH                0x00000008

#define _GLCDCLUT141_RED_POSITION                0x00000010
#define _GLCDCLUT141_RED_MASK                    0x00FF0000
#define _GLCDCLUT141_RED_LENGTH                  0x00000008

#define _GLCDCLUT142_BLUE_POSITION               0x00000000
#define _GLCDCLUT142_BLUE_MASK                   0x000000FF
#define _GLCDCLUT142_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT142_GREEN_POSITION              0x00000008
#define _GLCDCLUT142_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT142_GREEN_LENGTH                0x00000008

#define _GLCDCLUT142_RED_POSITION                0x00000010
#define _GLCDCLUT142_RED_MASK                    0x00FF0000
#define _GLCDCLUT142_RED_LENGTH                  0x00000008

#define _GLCDCLUT143_BLUE_POSITION               0x00000000
#define _GLCDCLUT143_BLUE_MASK                   0x000000FF
#define _GLCDCLUT143_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT143_GREEN_POSITION              0x00000008
#define _GLCDCLUT143_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT143_GREEN_LENGTH                0x00000008

#define _GLCDCLUT143_RED_POSITION                0x00000010
#define _GLCDCLUT143_RED_MASK                    0x00FF0000
#define _GLCDCLUT143_RED_LENGTH                  0x00000008

#define _GLCDCLUT144_BLUE_POSITION               0x00000000
#define _GLCDCLUT144_BLUE_MASK                   0x000000FF
#define _GLCDCLUT144_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT144_GREEN_POSITION              0x00000008
#define _GLCDCLUT144_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT144_GREEN_LENGTH                0x00000008

#define _GLCDCLUT144_RED_POSITION                0x00000010
#define _GLCDCLUT144_RED_MASK                    0x00FF0000
#define _GLCDCLUT144_RED_LENGTH                  0x00000008

#define _GLCDCLUT145_BLUE_POSITION               0x00000000
#define _GLCDCLUT145_BLUE_MASK                   0x000000FF
#define _GLCDCLUT145_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT145_GREEN_POSITION              0x00000008
#define _GLCDCLUT145_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT145_GREEN_LENGTH                0x00000008

#define _GLCDCLUT145_RED_POSITION                0x00000010
#define _GLCDCLUT145_RED_MASK                    0x00FF0000
#define _GLCDCLUT145_RED_LENGTH                  0x00000008

#define _GLCDCLUT146_BLUE_POSITION               0x00000000
#define _GLCDCLUT146_BLUE_MASK                   0x000000FF
#define _GLCDCLUT146_BLUE_LENGTH                 0x00000008

#define _GLCDCLUT146_GREEN_POSITION              0x00000008
#define _GLCDCLUT146_GREEN_MASK                  0x0000FF00
#define _GLCDCLUT146_GREEN_LENGTH                0x00000008

#define _GLCDCLUT146_RED_POSITION                0x00000010
#define _GLCDCLUT146_RED_MASK                    0x00FF0000
#define _GLCDCLUT146_RED_LENGTH                  0x00000008

#define _GLCDCLUT147_BLUE_POSITION               0x00000000
#define _GLCDCLUT147_BLUE_MASK                   0x000000FF
#define _GLCDCLUT147_BLUE_LENGTH                 0x00000008

